MyBlog/app/controllers/books_controller.rb

INSERT INTO "books" ("titile", "author", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["titile", "abc"], ["author", "msabcmnzs"], ["image", "mnbmnb"], ["created_at", "2019-12-16 10:13:39.115069"], ["updated_at", "2019-12-16 10:13:39.115069"]]
---
    def create
    @book = Book.create(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "titile" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["titile", "Shatry"], ["updated_at", "2019-12-16 11:52:21.460211"], ["id", 1]]
---
def update
    @book =Book.find(params[:id])
    @book.update(book_params)